#pragma once
#define SOL_ALL_SAFETIES_ON 1
#include "nine_meter_poggers.hpp"

#include "esp.hpp"

#include "memory/defs.h"
#include "memory/minhook/include/MinHook.h"
//#include "gui/OnGUI.hpp"
#define CALLED_BY(func,off) (reinterpret_cast<std::uint64_t>(_ReturnAddress()) > func && reinterpret_cast<std::uint64_t>(_ReturnAddress()) < func + off)


void dhook(void* func, void** og, void* dtr) {
	if (MH_Initialize() != MH_OK && MH_Initialize() != MH_ERROR_ALREADY_INITIALIZED) {
		return;
	}
	MH_CreateHook(func, dtr, og);
	MH_EnableHook(func);
}

int fp = 0;
int spin = 0;
int jitter = 0;

namespace hooks {
	namespace orig {
		static auto baseplayer_client_input = reinterpret_cast<void (*)(BasePlayer*, InputState*)>(*reinterpret_cast<uintptr_t*>(il2cpp::method(_("BasePlayer"), _("ClientInput"), -1, _(""), _(""))));
		static auto requestuserinfo = reinterpret_cast<void (*)(Client*, uintptr_t)>(*reinterpret_cast<uintptr_t*>(il2cpp::method(_("Client"), _("OnRequestUserInformation"), 1, _(""), _(""))));
		static auto playermodel_updatelocalvelocity = reinterpret_cast<void (*)(PlayerModel*, Vector3, Transform*)>(*reinterpret_cast<uintptr_t*>(il2cpp::method(_("PlayerModel"), _("UpdateLocalVelocity"), 2, _(""), _(""))));
		static auto BaseProjectile_OnSignal = reinterpret_cast<void (*)(BaseProjectile*, int, System::string)>(*reinterpret_cast<uintptr_t*>(il2cpp::method(_("BaseProjectile"), _("OnSignal"), 2, _(""), _(""))));

					const auto TOD_Night = *reinterpret_cast<uintptr_t*>(tod_sky + 0x58);
					const auto TOD_Stars = *reinterpret_cast<uintptr_t*>(tod_sky + 0x70);

					const auto tod_component = *reinterpret_cast<uintptr_t*>(tod_sky + 0xA8);

					Vector4 sun_color = Vector4(vars->colors.sun[0],
						vars->colors.sun[1],
						vars->colors.sun[2],
						vars->colors.sun[3]);
					Vector4 moon_color = Vector4(vars->colors.moon[0],
						vars->colors.moon[1],
						vars->colors.moon[2],
						vars->colors.moon[3]);

					//*(Vector4**)(mem::read<uintptr_t>(TOD_Day + 0x10) + 0x10) = &sun_color;
					//*(Vector4**)(mem::read<uintptr_t>(TOD_Day + 0x18) + 0x10) = &sun_color;
					//*(Vector4**)(mem::read<uintptr_t>(TOD_Day + 0x20) + 0x10) = &sun_color;
					//*(Vector4**)(mem::read<uintptr_t>(TOD_Day + 0x28) + 0x10) = &sun_color;

					//*(Vector4**)(mem::read<uintptr_t>(TOD_Night + 0x10) + 0x10) = &moon_color;
					//*(Vector4**)(mem::read<uintptr_t>(TOD_Night + 0x18) + 0x10) = &moon_color;
					//*(Vector4**)(mem::read<uintptr_t>(TOD_Night + 0x20) + 0x10) = &moon_color;
					//*(Vector4**)(mem::read<uintptr_t>(TOD_Night + 0x28) + 0x10) = &moon_color;

					* (float*)(TOD_Night + 0x50) = vars->visual.night;
					*(float*)(TOD_Night + 0x54) = vars->visual.night;
					*(float*)(TOD_Day + 0x50) = vars->visual.day;
					*(float*)(TOD_Day + 0x54) = vars->visual.day;
					*(float*)(TOD_Stars + 0x14) = vars->visual.staramount;


					RenderSettings::set_ambientLight(tod_sky,
						{
							vars->visual.ambcol[0],
							vars->visual.ambcol[1],
							vars->visual.ambcol[2],
							vars->visual.ambcol[3]
						});

				}
				last_object = current_tagged_obj;
				current_tagged_base = mem::read<uintptr_t>(current_tagged_base + 0x8);
				current_tagged_obj = mem::read<uintptr_t>(current_tagged_base + 0x10);
			}
		}
	}

	static uintptr_t* serverrpc_projecshoot;
	static uintptr_t* serverrpc_playerprojectileattack;
	static uintptr_t* serverrpc_playerprojectileupdate;

	int pppid = 0;

	void hk_serverrpc_projectileshoot(int64_t rcx, int64_t rdx, int64_t r9, int64_t projectileShoot, int64_t arg5) {
		Projectile* p;
		Vector3 rpc_position;
		float time = get_fixedTime();
		float travel_t = 0.f;
		int simulations = 0;
		bool ismelee = false;
		do {
			if (!vars->local_player)
				break;

			auto Item = vars->local_player->GetActiveItem();

			if (!Item)
				break;

			auto baseprojectile = vars->local_player->GetActiveItem()->GetHeldEntity<BaseProjectile>();
			if (!baseprojectile)
				break;

			auto wep_class_name = *(const char**)(*(uintptr_t*)(uintptr_t)baseprojectile + 0x10);
			if (*(int*)(wep_class_name + 4) == 'eleM' || *(int*)(wep_class_name) == 'ddaP') {
				//is melee weapon
				if (vars->combat.psilentmelee) {
					ismelee = true;
				}
				else break;
			}

			vars->matrix = unity::get_view_matrix();
			auto camera_pos = unity::get_camera_pos();

			//aim_target target = vars->local_player->get_aimbot_target(camera_pos);
			aim_target target = vars->best_target;

			/*
				struct projectileshoot_projectile {
		bool ShouldPool; // 0x10
		bool _disposed; // 0x11
		int projectileID; // 0x14
		Vector3 startPos; // 0x18
		Vector3 startVel; // 0x24
		int seed; // 0x30
	};
	struct projectileshoot {
		bool ShouldPool; // 0x10
		bool _disposed; // 0x11
		int ammoType; // 0x14
		projectileshoot_projectile projectiles[]; //0x18
		//std::vector<projectileshoot_projectile> projectiles;
	};
			*/

			uintptr_t shoot_list = *(uintptr_t*)(*(uintptr_t*)(projectileShoot + 0x18));// + 0x10);

			if(!misc::emulated)
				shoot_list = *(uintptr_t*)(*(uintptr_t*)(projectileShoot + 0x18) + 0x10);

			auto size = *(int*)(*(uintptr_t*)(projectileShoot + 0x18) + 0x18);

			Vector3 aimbot_velocity = Vector3(0,0,0);

			const auto stats = baseprojectile->get_stats(Item->get_item_definition_id());

			Vector3 aim_angle;

			bool manipulated = false;

			Vector3 original_vel{};

			bool vis_fat = false;
			//get position of player with velocity
			//get direction to that
			//calculate perfect Y velocity in loop to find where projectile lands
			

			//calc new target position with velocity
			Vector3 target_velocity, target_pos;
			if (target.ent)
			{
				if (!target.ent->is_alive())
					target.Reset();
				target_pos = target.pos;
			}

